INSERT INTO problem (title, question, solution, grading, level, created_date, modified_date)
VALUES
    ('Array vs  LinkedList', '배열(Array)과 연결 리스트(LinkedList)의 데이터 접근 및 데이터 추가/삭제 관점에서 각각의 특성과 장단점을 비교해 주세요.',
     '배열은 메모리에 연속적으로 저장되어 인덱스를 통해 빠르게 접근할 수 있지만, 크기가 고정되어 있고 삽입 및 삭제가 비효율적입니다. 반면, 연결 리스트는 노드들이 포인터로 연결된 구조로, 크기를 동적으로 조정할 수 있고 삽입 및 삭제가 효율적이지만, 인덱스를 통한 직접 접근이 불가능하며 추가적인 메모리를 필요로 합니다.',
     '', 1, now(), now()),
    ('객체지향 프로그래밍의 특징', '객체지향 프로그래밍의 대표적인 4가지 특징이 무엇인지 말하고 특징 2개를 골라서 설명해주세요.', '객체지향 프로그래밍의 특징으로는 데이터 보호를 위한 캡슐화, 기능을 단순화하는 추상화, 코드 재사용성을 높이는 상속, 다양한 객체의 유연한 동작을 가능하게 하는 다형성이 있습니다.'
    ,'', 1, now(), now()),
    ('Array vs  LinkedList', '배열(Array)과 연결 리스트(LinkedList)의 데이터 접근 및 데이터 추가/삭제 관점에서 각각의 특성과 장단점을 비교해 주세요.',
     '배열은 메모리에 연속적으로 저장되어 인덱스를 통해 빠르게 접근할 수 있지만, 크기가 고정되어 있고 삽입 및 삭제가 비효율적입니다. 반면, 연결 리스트는 노드들이 포인터로 연결된 구조로, 크기를 동적으로 조정할 수 있고 삽입 및 삭제가 효율적이지만, 인덱스를 통한 직접 접근이 불가능하며 추가적인 메모리를 필요로 합니다.',
     '', 1, now(), now()),
    ('객체지향 프로그래밍의 특징', '객체지향 프로그래밍의 대표적인 4가지 특징이 무엇인지 말하고 특징 2개를 골라서 설명해주세요.', '객체지향 프로그래밍의 특징으로는 데이터 보호를 위한 캡슐화, 기능을 단순화하는 추상화, 코드 재사용성을 높이는 상속, 다양한 객체의 유연한 동작을 가능하게 하는 다형성이 있습니다.'
    ,'', 1, now(), now()),
    ('Array vs  LinkedList', '배열(Array)과 연결 리스트(LinkedList)의 데이터 접근 및 데이터 추가/삭제 관점에서 각각의 특성과 장단점을 비교해 주세요.',
     '배열은 메모리에 연속적으로 저장되어 인덱스를 통해 빠르게 접근할 수 있지만, 크기가 고정되어 있고 삽입 및 삭제가 비효율적입니다. 반면, 연결 리스트는 노드들이 포인터로 연결된 구조로, 크기를 동적으로 조정할 수 있고 삽입 및 삭제가 효율적이지만, 인덱스를 통한 직접 접근이 불가능하며 추가적인 메모리를 필요로 합니다.',
     '', 1, now(), now()),
    ('객체지향 프로그래밍의 특징', '객체지향 프로그래밍의 대표적인 4가지 특징이 무엇인지 말하고 특징 2개를 골라서 설명해주세요.', '객체지향 프로그래밍의 특징으로는 데이터 보호를 위한 캡슐화, 기능을 단순화하는 추상화, 코드 재사용성을 높이는 상속, 다양한 객체의 유연한 동작을 가능하게 하는 다형성이 있습니다.'
    ,'', 1, now(), now()),
    ('Array vs  LinkedList', '배열(Array)과 연결 리스트(LinkedList)의 데이터 접근 및 데이터 추가/삭제 관점에서 각각의 특성과 장단점을 비교해 주세요.',
     '배열은 메모리에 연속적으로 저장되어 인덱스를 통해 빠르게 접근할 수 있지만, 크기가 고정되어 있고 삽입 및 삭제가 비효율적입니다. 반면, 연결 리스트는 노드들이 포인터로 연결된 구조로, 크기를 동적으로 조정할 수 있고 삽입 및 삭제가 효율적이지만, 인덱스를 통한 직접 접근이 불가능하며 추가적인 메모리를 필요로 합니다.',
     '', 1, now(), now()),
    ('객체지향 프로그래밍의 특징', '객체지향 프로그래밍의 대표적인 4가지 특징이 무엇인지 말하고 특징 2개를 골라서 설명해주세요.', '객체지향 프로그래밍의 특징으로는 데이터 보호를 위한 캡슐화, 기능을 단순화하는 추상화, 코드 재사용성을 높이는 상속, 다양한 객체의 유연한 동작을 가능하게 하는 다형성이 있습니다.'
    ,'', 1, now(), now());

